# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-03-08 22:49:15 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* kryLisp [2/6]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A naive Lisp interpreter, written in Python.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-03-08 Sa 22:49]
   | Headline               | Time    |         |      |
   |------------------------+---------+---------+------|
   | *Total time*           | *13:56* |         |      |
   |------------------------+---------+---------+------|
   | *kryLisp [2/6]*        | *13:56* |         |      |
   | \_  /Components [0/2]/ |         | /13:56/ |      |
   | \_    Parser           |         |         | 4:54 |
   | \_    Interpreter      |         |         | 9:02 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/2]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** TODO Parser
    :LOGBOOK:
    CLOCK: [2024-05-19 So 17:33]--[2024-05-19 So 21:18] =>  3:45
    CLOCK: [2024-05-19 So 15:56]--[2024-05-19 So 17:05] =>  1:09
    :END:
*** TODO Interpreter
    :LOGBOOK:
    CLOCK: [2025-03-08 Sa 16:24]--[2025-03-08 Sa 22:49] =>  6:25
    CLOCK: [2024-05-20 Mo 14:29]--[2024-05-20 Mo 17:06] =>  2:37
    :END:
** Bugs [2/4]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** TODO Linters to the rescue [2/3]
    I wrote a Lisp interpreter in Python many years ago (2010, apparently),
    and I am trying to copy some of the code, which makes the linters scream.
    The old code was written for Python 2, so ... no surprise there.
    So here's what I am going to do:
**** DONE Pacify the linters
     CLOSED: [2025-03-08 Sa 15:05]
     Fix everything the linters are barking at
**** DONE Add type hints
     CLOSED: [2025-03-08 Sa 15:05]
     Add type annotations, as far as possible and helpful
**** TODO Testing
     I should probably write some tests, too.
